let nature = "Работа в саду, огороде, ухаживать за растениями, животными, интерес к предмету биология. " +
        "Предметом труда для представителей большинства профессий типа «человек-природа» являются: изучением живой и неживой природы, условия их роста, жизни; растения, условия их произрастания. " +
        "Специалистам в этой области приходится выполнять следующие виды деятельности: изучать, исследовать, анализировать состояние, условия жизни растений или животных (агроном, микробиолог, зоотехник, гидробиолог, агрохимик, фитопатолог, геолог); выращивать растения, ухаживать за животными (лесовод, кинолог, ихтиолог, грумер, полевод, цветовод, овощевод, птицевод, животновод, садовод, пчеловод); проводить профилактику заболеваний растений и животных (ветеринар, врач карантинной службы, лаборант химико-бактериологического анализа); изучать и исследовать неживую природу (метеоролог, эколог). " +
        "Психологические требования профессий «человек-природа»: развитое воображение, наглядно-образное мышление, хорошая зрительная память, наблюдательность, способность предвидеть и оценивать изменчивые природные факторы; поскольку результаты деятельности выявляются по прошествии довольно длительного времени, специалист должен обладать терпением, настойчивостью, должен быть готовым работать вне коллективов, иногда в трудных погодных условиях, в грязи и т.п. ",
    technology = "Вам нравятся лабораторные работы по физике, химии, электротехнике, делаете модели, разбираетесь в бытовой технике, создаете и монтируетет, эксплуатируете, собираете, налаживаете, ремонтируете машины, механизмы, аппараты, станки. " +
        "Предметом труда для представителей большинства профессий типа «человек-техника» является не только на техника, но и предмет профессионального внимания - область технических объектов и их свойств: профессии по добыче, обработке грунтов, горных пород; профессии по обработке и использованию неметаллических промышленных материалов, изделий, полуфабрикатов; профессии по производству и обработке металла, механической сборке, монтажу машин, приборов; профессии по ремонту, наладке, обслуживанию технологических машин, установок, транспортных средств; профессии по монтажу, ремонту зданий, сооружений, конструкций; профессии по сборке, монтажу электрооборудования, приборов, аппаратов; профессии по ремонту, наладке, обслуживанию электрооборудования, приборов, аппаратов; профессии, связанные с применением подъемных, транспортных средств, управление ими; профессии по переработке продуктов сельского хозяйства. " +
        "Специалистам в этой области приходится выполнять следующие виды деятельности: из отдельных узлов, деталей собирают машины, механизмы, приборы, регулируют и налаживают их, специалисты проектируют, конструируют технические системы, устройства, разрабатывают процессы их изготовления. " +
        "Каменщик, монтажник, инженер-конструктор сварщик; эксплуатация технических средств - специалисты работают на станках, управляют транспортом, автоматическими системами. " +
        "Водитель, машинист крана, бульдозера, крановщик, швея, токарь, тестировщик программного обеспечения; ремонт технических устройств - специалисты выявляют, распознают неисправности технических систем, приборов, механизмов, ремонтируют, регулируют, налаживают их. " +
        "Слесарь-ремонтник, механик, ремонтник горного оборудования, электромонтер по ремонту оборудования, столяр, техник-металлург, инженер-механик, архитектор, электромонтажник, радиомеханик, сстроитель, сборщик компьютеров, системный администратор, специалист по телекоммуникациям и др. " +
        "Психологические требования профессий «человек-техника»: хорошая координация движений; точное зрительное, слуховое, вибрационное и кинестетическое восприятие; развитое техническое и творческое мышление и воображение; умение переключать и концентрировать внимание; наблюдательность. ",
    sign = "Вы любите выполнять вычисления, чертежи, формулы, цифры, таблицы, схемы, вести картотеки, систематизировать различные сведения, изучать языки, заниматься программированием, экономикой или статистикой, финансами и т.п. " +
        "Большинство профессий этого типа связано с переработкой информации. " +
        "Предметом труда для представителей большинства профессий типа «человек-знаковая система» являются: языки и тексты на родном или иностранном языках (переводчик, филолог, лингвист, редактор, корректор, делопроизводитель, телеграфист, наборщик); цифры, формулы, таблицы (программист, оператор компьютерного набору, экономист, бухгалтер, статистик, аудитор, кассир); чертежи, схемы, карты (конструктор, строитель, инженер-технолог, чертежник, копировальщик, штурман, геодезист); звуковые сигналы (радист, стенографист, телефонист, звукооператор, звукорежесер). " +
        "Психологические требования профессий «человек-знаковая система»: хорошая оперативная и механическая память; способность к длительной концентрации внимания на отвлеченном (знаковом) материале; хорошее распределение и переключение внимания; точность восприятия, умение видеть то, что стоит за условными знаками; усидчивость, терпение; логическое мышление. ",
    artisticImage = "Художественный образ, способы его построения. " +
        "Предметом труда для представителей большинства профессий типа «человек-художественный образ» является: профессии, связанные с изобразительной деятельностью профессии, связанные с музыкальной деятельностью; профессии, связанные с литературно-художественной деятельностью; профессии, связанные с актерско-сценической деятельностью. " +
        "Специалистам в этой области приходится выполнять следующие виды деятельности: создание, проектирование моделированием художественных произведений (писатель, дизайнер (графический, WEB, интерьера), художник, композитор, модельер, архитектор, скульптор, журналист, литературный работник, хореограф); воспроизведение, изготовление различных изделий по образцу (ювелир, реставратор, гравер, музыкант, актер, столяр-краснодеревщик); размножение художественных произведений в массовом производстве (мастер по росписи фарфора, парикмахер, визажист, шлифовщик по камню и хрусталю, маляр, печатник). " +
        "Психологические требования профессий «человек-художественный образ»: художественные способности; развитое зрительное восприятие; наблюдательность, зрительная память; наглядно-образное мышление; творческое воображение; знание психологических законов эмоционального воздействия на людей. ",
    human = "Сюда относятся профессии, связанные с воспитанием, обучением, медицинское обслуживанием, бытовым обслуживанием, информационным обслуживанием, защитой общества и государства. " +
        "Предметом труда для представителей большинства профессий типа «человек -человек» являются взрослые и дети. " +
        "Специалистам в этой области приходится выполнять следующие виды деятельности: профессии, связанные с управлением производством, руководством людьми, коллективами (менеджер - по продажам, персоналу, социальный работник, политолог, психолог); профессии, связанные с бытовым, торговым обслуживанием(продавец, парикмахер, официант, вахтер); профессии, связанные с информационным обслуживанием (библиотекарь, экскурсовод, лектор); профессии, связанные с информационно-художественным обслуживанием людей и руководством художественными коллективами (экскурсоводы в картинных галереях или консультанты в художественных магазинах, руководителя художественного кружка); профессии, связанные с обучением и воспитанием людей, организацией детских коллективов людей (воспитатель, учитель, бизнес-тренер, спортивный тренер); профессии, связанные с медицинским обслуживанием(врач, фельдшер, медсестра, няня); профессии, связанные с защита общества и государства (юрист, правовед, милиционер, инспектор, военнослужащий). " +
        "Психологические требования профессий «человек-человек»: стремление к общению, умение легко вступать в контакт с незнакомыми людьми; устойчивое хорошее самочувствие при работе с людьми; доброжелательность, отзывчивость; выдержка; умение сдерживать эмоции; способность анализировать поведение окружающих и свое собственное, понимать намерения и настроение других людей, способность разбираться во взаимоотношениях людей, умение улаживать разногласия между ними, организовывать их взаимодействие; способность мысленно ставить себя на место другого человека, умение слушать, учитывать мнение другого человека; способность владеть речью, мимикой, жестами; развитая речь, способность находить общий язык с разными людьми; умение убеждать людей; аккуратность, пунктуальность, собранность; знание психологии людей. ";

module.exports = {
    name: "Опросник профессиональной готовности",
    type: require('../types').PROF_READINESS,
    icon: 'yeoman.png',
    shortDesc: "Опросник (методика) разработан Л.Н. Кабардовой. Профессиональную готовность определяют как субъективное состояние личности, означающее желание и способность заниматься данным видом профессиональной деятельности. Опросник построен на самооценке человеком своих склонностей и возможностей. ",
    longDesc: "",
    instruction: "Внимательно прочтите высказывание. Затем ответьте на три нижеприведенных вопроса. ",
    content: {
        questions: [
            {
                name: "Насколько хорошо вы умеете делать то, о чем написано в высказывании?",
                type: 'skill',
                variants: [
                    "делаю, как правило, хорошо",
                    "делаю средне",
                    "делаю плохо, совсем не умею"
                ]
            }, {
                name: "Какие ощущения у вас возникали, когда вы это делали?",
                type: 'attitude',
                variants: [
                    "положительные (приятно, интересно, легко)",
                    "нейтральные (все равно)",
                    "отрицательные (неприятно, неинтересно, трудно)"
                ]
            }, {
                name: "Хотели бы вы, чтобы описанное в высказывании действие было включено в вашу будущую работу?",
                type: 'desire',
                variants: [
                    "да",
                    "все равно",
                    "нет"
                ]
            }
        ],
        statement: [
            "Делать выписки, вырезки из различных текстов и группировать их по определенному признаку. ",
            "Выполнять практические задания на лабораторных работах по физике (собирать и составлять схемы, устранять в них неисправности, разбираться в принципе действия прибора и т. п.). ",
            "Длительное время (более одного года) самостоятельно выполнять все работы, обеспечивающие рост и развитие растений (поливать, удобрять, пересаживать и пр.). ",
            "Сочинять стихи, рассказы, заметки, писать сочинения, признаваемые многими интересными, достойными внимания. ",
            "Сдерживать себя, не «выплескивать» на окружающих свое раздражение, гнев, обиду, плохое настроение. ",
            "Выделять из текста основные мысли и составлять на их основе краткий конспект, план, новый текст. ",
            "Разбираться в физических процессах и закономерностях, решать задачи по физике. ",
            "Вести регулярное наблюдение за развивающимся растением и записывать данные наблюдений в специальный дневник. ",
            "Мастерить красивые изделия из дерева, ткани, металла, засушенных растений, ниток. ",
            "Терпеливо, без раздражения объяснять что-то непонятное кому-либо, даже если приходится повторять это несколько раз. ",
            "Легко находить ошибки в письменных работах по русскому языку, литературе. ",
            "Разбираться в химических процессах, свойствах химических элементов, решать задачи по химии. ",
            "Разбираться в особенностях развития и во внешних отличительных признаках многочисленных видов растений. ",
            "Создавать законченные произведения живописи, графики, скульптуры. ",
            "Много и часто общаться с разными людьми, не уставая от этого. ",
            "На уроках иностранного языка отвечать на вопросы и задавать их, пересказывать тексты и составлять рассказы по заданной теме. ",
            "Отлаживать какие-либо механизмы (велосипед, мотоцикл), ремонтировать электротехнические приборы (пылесос, утюг, светильник). ",
            "Свое свободное время тратить преимущественно на уход и наблюдение за каким-нибудь животным. ",
            "Сочинять музыку, песни, имеющие успех у сверстников и взрослых. ",
            "Внимательно, терпеливо, не перебивая, выслушивать людей. ",
            "При выполнении заданий по иностранному языку без особых трудностей работать с текстами. ",
            "Налаживать и чинить электронную аппаратуру (приемник, магнитофон, телевизор, аппаратуру для дискотек). ",
            "Регулярно, без напоминания взрослых, ухаживать за животными: кормить, чистить (животное и клетку), лечить, обучать. ",
            "Публично, для многих зрителей, разыгрывать роли, изображать кого-либо, декламировать стихи, прозу. ",
            "Увлекать делом, игрой, рассказом детей младшего возраста. ",
            "Выполнять задания по математике, химии, в которых требуется составлять логическую цепочку действий, используя при этом различные формулы, законы, теоремы. ",
            "Ремонтировать замки, краны, мебель, игрушки. ",
            "Разбираться в породах и видах животных (лошадей, птиц, рыб, насекомых и пр.), знать их характерные внешние признаки и повадки. ",
            "Всегда четко видеть, что сделано писателем, драматургом, художником, режиссером, актером талантливо, а что нет, и уметь обосновать это устно или письменно. ",
            "Организовывать людей на какие-либо дела, мероприятия. ",
            "Выполнять задания по математике, требующие хорошего знания формул, законов и умения правильно применять их при решении. ",
            "Выполнять действия, требующие хорошей координации движений и ловкости рук: работать на станке, электрической швейной машине, производить монтаж изделий из мелких деталей. ",
            "Сразу замечать мельчайшие изменения в поведении животного или внешнем виде растения. ",
            "Играть на музыкальных инструментах, публично исполнять песни, танцевальные номера. ",
            "Выполнять работу, требующую обязательных контактов со множеством разных людей. ",
            "Выполнять количественные расчеты, подсчеты данных (по формулам и без них), выводить на основе этого различные закономерности, выявлять следствия. ",
            "Из типовых деталей, предназначенных для сборки определенных моделей, изделий, конструировать новые, придуманные самостоятельно. ",
            "Специально заниматься углубленным изучением биологии, ботаники, зоологии — читать научную литературу, слушать лекции, научные доклады. ",
            "Создавать на бумаге и в оригинале новые, интересные модели (одежды, причесок, украшений), интерьеры помещений, конструкции изделий. ",
            "Влиять на людей, убеждать, предотвращать конфликты, улаживать ссоры, разрешать споры. ",
            "Работать с условно-знаковой информацией: составлять и рисовать схемы, карты, чертежи. ",
            "Выполнять задания, в которых требуется мысленно представлять расположение предметов или фигур в пространстве. ",
            "Длительное время заниматься исследовательскими работами в биологических кружках, на биостанциях, в зоокружках и питомниках. ",
            "Быстрее и чаще других замечать в обычном необычное, удивительное, прекрасное. ",
            "Сопереживать людям (даже не очень близким), понимать их проблемы, оказывать посильную помощь. ",
            "Аккуратно и безошибочно выполнять «бумажную» работу: писать, выписывать, проверять, подсчитывать. ",
            "Выбирать наиболее рациональный (простой, короткий) способ решения задачи: технической, логической, математической. ",
            "Занимаясь растениями или животными, выполнять тяжелую физическую работу, переносить неблагоприятные погодные условия, грязь, специфический запах. ",
            "Настойчиво, терпеливо добиваться совершенства в создаваемом или исполняемом произведении (в любой сфере творчества)",
            "Говорить, сообщать что-либо, излагать свои мысли вслух. "
        ],
        likes: ["человек - знак", "человек - техника", "человек - природа", "человек - художественный образ", "человек - человек"],
        description: [sign, technology, nature, artisticImage, human]
    },
    func: function (answers) {
        let columnsSums = [],
            likes = [0, 1, 2, 3, 4],
            sums = [];

        for (let i = 0; i < answers.length; i++) {
            let reminder = i % 5,
                answer = answers[i],
                sum = columnsSums[reminder] = columnsSums[reminder] || {};

            for (var field in answer) {
                sum[field] = sum[field] || 0;
                sum[field] += answer[field];
            }
        }

        sums = sums.concat(columnsSums);
        for (let i = 0; i < sums.length; i++) {
            let diffI = Math.abs((sums[i].attitude + sums[i].desire) / 2 - sums[i].skill);

            for (let j = 0; j < sums.length; j++) {
                let diffJ = Math.abs((sums[j].attitude + sums[j].desire) / 2 - sums[j].skill);

                if ((sums[i].attitude + sums[i].desire < sums[j].attitude + sums[j].desire || sums[i].skill < sums[j].skill)
                    && diffI > diffJ) {

                    [sums[i], sums[j]] = [sums[j], sums[i]];
                    [likes[i], likes[j]] = [likes[j], likes[i]];
                }
            }
        }

        likes.reverse();

        return {result: {
            columnsSums,
            likes
        }};
    }
};
