module.exports = {
	name: "Системный выбор профессии",
	type: require('../types').SYSTEM_PROF_CHOICE,
	shortDesc: "",
	longDesc: "",
	instruction: "Выберите утверждения, которые наиболее вам соответствуют",
	content: {
		categories: [
			{
				name: "В моей будущей професии я хочу...",
				questions: [
					{
						5: "проверять качество материалов",
						8: "внимательно консультировать клиентов клиентов",
						2: "разрабатывать и следить за состоянием компьютерных программ"
					}, {
						1: "проводить эксперименты",
						7: "создавать документальные фильмы",
						4: "реализовывать план операции"
					}, {
						3: "проверять заказы",
						6: "разрабатывать новый дизайн продукции",
						8: "заключать контракты"
					}, {
						2: "работать с банком данных",
						7: "организовывать выставки",
						1: "испытывать комбинации биологически активных веществ"
					}, {
						4: "работать по утвержденному образцу",
						1: "анализировать научные тексты",
						3: "готовить финансовые отчеты"
					}, {
						5: "снижать шумовой эффект машин",
						3: "вести архив важных документов",
						6: "создавать образцы модной одежды"
					}, {
						3: "координировать сроки",
						8: "опрашивать людей",
						2: "представлять результаты исследований"
					}, {
						7: "организовывать концертные поездки",
						5: "устанавливать электронные системы",
						4: "тщательно выполнять условия контрактов"
					}, {
						4: "планомерно действовать",
						2: "осуществлять процесс купли и продажи посредством интернета",
						8: "обеспечивать людей информацией, легко доступной для понимания"
					}, {
						6: "формулировать рекламные тексты",
						4: "пополнять запасы",
						1: "содействовать в развитии чего-либо"
					}, {
						7: "переводить литературные произведения",
						1: "вести точные наблюдения за животными и растениями",
						3: "сравнивать показатели"
					}, {
						8: "сопровождать и возглавлять группы",
						2: "организовывать и совершенствовать обмен",
						7: "продавать произведения искусства"
					}, {
						7: "пробуждать интерес к другим культарам",
						2: "обучать коллег и покупателей обращению с компьютером",
						5: "измерять уровень жаростойкости материала"
					}, {
						4: "создавать каталоги коллекций",
						1: "применять сравнительные исследования",
						6: "создавать компьютерные презентации"
					}, {
						6: "разрабатывать эскизы плакатов",
						3: "составлять прайс-листы",
						5: "управлять процессом производства"
					}, {
						8: "общаться с клиентами посредством интернета",
						4: "проверять качество продукции",
						7: "комментировать происходящее"
					}, {
						2: "обслуживать компьютерные сети",
						8: "поддерживать деловые контакты",
						4: "модернизировать файлы"
					}, {
						6: "создавать вещи, облегчающие работу",
						5: "снижать выброс вредных веществ",
						8: "разрешать конфликты"
					}, {
						2: "устранять ошибки в компьютерной системе",
						3: "координировать грузоперевозки",
						5: "обслуживать и ремонтировать автоматы"
					}, {
						6: "предлагать образцы ткани",
						7: "следить за развитием книжного рынка",
						1: "разрабытывать новые вычислительные методы"
					}, {
						3: "использовать складские запасы",
						2: "внедрять современные компьютерные установки",
						7: "деятельность в сфере искусства"
					}, {
						5: "монтировать запасные части",
						6: "разрабатывать дизайн интерьера",
						7: "разрабатывать дизайн интерьера с чувством глубокого эстетического вкуса"
					}, {
						8: "вести переговоры о продаже",
						6: "хранить компьютерные дискеты",
						3: "заносить данные в компьютер"
					}, {
						1: "с точностью интерпретировать статистические данные",
						5: "хранить компьютерные дискеты",
						2: "заносить данные в компьютер"
					}
				]
			},
			{
				name: "В моей профессии я доверяю себе...",
				questions: [
					{
						4: "разрабатывать план организации процесса",
						2: "решать задачи с 3-мя неизвестными",
						1: "разбираться в чертежах конструкций"
					}, {
						3: "четко формулировать",
						6: "разрабатывать различные решения проблем",
						5: "идти навстречу людям"
					}, {
						8: "выполнять с точностью ручную работу",
						5: "открыто говорить о своих чувствах",
						7: "применять подходящий инструмент"
					}, {
						7: "монтировать детали оборудования",
						9: "напряженно работать над чем-либо",
						1: "разрабатывать черетежи внутренней мобилировки"
					}, {
						9: "не давать себя отвлечь во время разговора",
						6: "разрабатывать задачи для конкурсов",
						2: "пересчитывать измерительные единицы"
					}, {
						8: "работать обеими руками быстро и точно",
						3: "создавать проекты контрактов",
						4: "в точности определять причины аварий"
					}, {
						7: "устанавливать оборудование",
						1: "изготавливать чертежи",
						4: "программировать"
					}, {
						5: "выступать с речью перед большой аудиторией",
						3: "находить объяснения сложным взаимосвязям",
						9: "быстро фиксировать собственные мысли на бумаге"
					}, {
						6: "рассматривать положение вещей с разных сторон",
						5: "с пониманием относиться к проблемам других людей",
						8: "работать с очень мелкими деталями"
					}, {
						4: "скреплять отдельные детали в правильной последовательности",
						1: "составлять себе представление о готовом продукте, который находится еще в разработке",
						2: "устанавливать выгодные цены"
					}, {
						9: "быстро справляться с работой",
						2: "контролировать план расходов",
						3: "интерпретировать тексты"
					}, {
						8: "изготавливать точные чертежи",
						7: "объяснять ход технических процессов на основе имеющейся модели",
						6: "умело аргументировать собственную точку зрения"
					}, {
						7: "ремонтировать испорченные приборы",
						3: "говорить, не стесняясь",
						5: "умело общаться с сотрудниками"
					}, {
						9: "безошибочно переносить данные",
						4: "устанавливать логические взаимосвязи",
						1: "разрабатывать технические чертежи"
					}, {
						6: "разрабатывать различные варианты текстов",
						8: "использовать очень мелкие орудия труда",
						2: "вычислять проценты"
					}, {
						2: "вычислять средние величины",
						5: "верно воспринимать чувства других людей",
						7: "распознавать источники технических проблем"
					}, {
						1: "верно определять расстояние по рисунку",
						8: "работать с микроскопом",
						4: "делать точные выводы"
					}, {
						6: "организовывать групповые развлекательные поездки",
						3: "вести переговоры",
						9: "хорошо справляться с рутинной работой"
					}, {
						8: "осуществлять ручной монтаж оборудования",
						6: "вести беседу",
						5: "поддерживать личные контакты"
					}, {
						2: "рассчитывать денежные суммы в иностранной валюте",
						1: "составлять себе представение о здании на основе проекции",
						8: "в точности переформировывать что-либо"
					}, {
						3: "перводить тексты на и с инностранного языка",
						9: "сосредотачиваться несмотря на шум со стороны",
						2: "разрабатывать кредитный план"
					}, {
						4: "разрешать хитросплетенные задачи",
						7: "обнаруживать неполадки при подключении электричества",
						9: "выполнять несколько дел одновременно"
					}, {
						7: "обслуживать оборудование",
						6: "организовывать мероприятия",
						1: "разрабатывать чертежи трехмерных моделей"
					}, {
						5: "оказывать поддержку плачущему человеку",
						3: "разрабатывать образцы рекламных текстов",
						4: "обнаруживать вещественные доказательства"
					}
				]
			}
		],
		interests: {
			1: {
				color: "#993366",
				name: "заниматься научной работой"
			},
			2: {
				color: "#FFCC00",
				name: "работать на компьютере"
			},
			3: {
				color: "#00FFFF",
				name: "обрабатывать числа и данные"
			},
			6: {
				color: "#008000",
				name: "иметь творческие идеи"
			},
			5: {
				color: "#FF0000",
				name: "обслуживать машины и оборудование"
			},
			4: {
				color: "#00FF00",
				name: "действовать согласно четко сформулированным планам"
			},
			7: {
				color: "#000080",
				name: "оформление средств массовой информации и передача опыта"
			},
			8: {
				color: "#993300",
				name: "осуществлять художественное информации и передавать"
			}
		},
		skills: {
			4: {
				color: "#008000",
				name: "логическое мышление"
			},
			2: {
				color: "#FFCC00",
				name: "математическое мышление"
			},
			3: {
				color: "#00FFFF",
				name: "речевое (языковое) мышление"
			},
			9: {
				color: "#FF99CC",
				name: "способность концентрироваться"
			},
			6: {
				color: "#00FF00",
				name: "находчивость, изобретательность"
			},
			5: {
				color: "#FF0000",
				name: "быть уверенным в общении"
			},
			8: {
				color: "#993300",
				name: "умелые руки"
			},
			1: {
				color: "#993366",
				name: "пространственное воображение"
			},
			7: {
				color: "#000080",
				name: "технический склад ума"
			}
		},
		professions: [
			"Биология, лесное и сельское хозяйство",
			"Питание, домашнее хозяйство, технология изготовления продуктов питания",
			"Химия, фармакология, биохимия, окружающая среда",
			"Архитектура, измерение, строительство",
			"Техника по дереву, цветовое оформление, дизайн помещения",
			"Оборудование по изготовлению искусственных и производственных материалов",
			"Математика и физика",
			"Машиностроение, металлотехника, электротехника",
			"Программирование и телекоммуникационная техника",
			"Мода, одежда, текстильная продукция",
			"Музыка, искусство, дизайн",
			"Медицина и психология",
			"Медицинские технологии и лаборатория",
			"Торговля, экономика и организация произодства и народное хозяйство",
			"Гастрономия, туризм",
			"Развлечения, спорт, развлечение",
			"Воспитание, получение и повышение квалификации",
			"Сопровождение, консультация, пастырство",
			"Языки и средства массовой информации",
			"Транспорт, уличное движение, доставка",
			"Юриспруденция и общественная безопасность",
			"Правовое и общественное управление"
		],
		map: [
			[[1, 3, 6, 5],	[2, 8, 7]],
			[[3, 6, 5],		[6, 4, 8, 7]],
			[[1, 2, 3, 5],	[6, 2, 9, 8]],
			[[2, 3, 5], 	[2, 5, 1, 7]],
			[[5, 4, 7, 8], 	[4, 8, 1]],
			[[2, 3, 5], 	[2, 9, 7]],
			[[1, 2, 3], 	[6, 2, 9]],
			[[2, 3, 6, 5], 	[2, 8, 1, 7]],
			[[1, 2, 3, 5], 	[6, 2, 9, 7]],
			[[2, 6, 4, 8], 	[9, 4, 8, 1]],
			[[4, 7, 8], 	[4, 5, 8, 1]],
			[[1, 5, 8], 	[3, 9, 5, 8]],
			[[6, 5, 8], 	[5, 8, 1, 7]],
			[[2, 3, 8], 	[2, 3, 5]],
			[[3, 6, 4, 8], 	[2, 3, 5]],
			[[4, 8], 		[3, 4, 5]],
			[[4, 7, 8], 	[3, 4, 5]],
			[[4, 8], 		[3, 9, 5]],
			[[2, 4, 7, 8], 	[3, 4, 5]],
			[[2, 3, 6, 5], 	[2, 3, 5, 7]],
			[[2, 3, 5, 8], 	[6, 3, 9, 5]],
			[[2, 3, 6, 8], 	[2, 3, 9, 5]]
		]
	},
	func: function (answers) {
		let res = { interests: {}, skills: {}, result: [] };

		function categoryMaxes(catName) {
			let counts = {};
			for (let block of answers[catName]) {
				for (let opt of block) {
					if (counts[opt]) counts[opt]++;
					else counts[opt] = 1;
				}
			}
			let max1 = [], max2 = [], max;
			for (let i in counts) {
				let count = counts[i];
				if (!max1.length || count == counts[max1[0]]) max1.push(i);
				else if (count > counts[max1[0]]) {
					max2 = max1;
					max1 = [i];
				}
				else if (!max2.length || count == counts[max2[0]]) max2.push(i);
				else if (count > counts[max2[0]]) max2 = [i];
			}
			max = max1.length > 1 ? max1 : max1.concat(max2);
			for (let key of max) {
				res[catName][key] = counts[key];
			}
		}

		categoryMaxes('interests');
		categoryMaxes('skills');

		let temp = [];
		for (let i = 0; i < this.content.map.length; i++) {
			let interests = this.content.map[i][0], skills = this.content.map[i][1];
			temp.push({index: 0, count: 0});
			temp[i].index = i;
			for (let inter of interests)
				if (res.interests[inter]) temp[i].count++;
			for (let skill of skills)
				if (res.skills[skill]) temp[i].count++;
		}
		res.result = temp.sort((el1, el2) => el2.count - el1.count);
		return res;
	}
};
