var instruction = "Выберите из представленых далее фигуру, о которая больше всего вам понравилась или первой преглянулась. " +
        "Постарайтесь почувствовать свою форму. " +
        "Если вы испытываете затруднение, выберите ту, которая первой привлекла вас. " +
        "Переместите фигуры в порядке вашего предпочтения.",

    square = "КВАДРАТ – неутомимый труженик. " +
        "Трудолюбие, усердие, потребность доводить начатое дело до конца, упорство, " +
        "позволяющее добиваться завершения работы, – вот основные качества истинных Квадратов. " +
        "Выносливость, терпение и методичность делают Квадрата высококлассным специалистом в своей области. " +
        "Этому способствует и неутолимая потребность в информации. " +
        "Все сведения, которыми они располагают, систематизированы и разложены по полочкам. " +
        "Если вы выбрали для себя квадрат – фигуру линейную, то, вероятнее всего, " +
        "вы относитесь к «левополушарным» мыслителям, т. е. к тем, кто перерабатывает данные последовательно... " +
        "Они скорее «вычисляют результат», чем догадываются о нем. " +
        "Они чрезвычайно внимательны к деталям, подробностям, любят порядок. " +
        "Их идеал – распланированная, предсказуемая жизнь. " +
        "Они постоянно «упорядочивают», организуют людей и вещи вокруг себя. " +
        "Квадраты могут стать хорошими специалистами – техниками, отличными администраторами, " +
        "но редко бывают хорошими менеджерами. " +
        "Чрезмерное пристрастие к деталям, " +
        "потребность в уточняющей информации для принятия решений лишает Квадрата оперативности. " +
        "Кроме того, рациональность, эмоциональная сухость, " +
        "консерватизм в оценках мешают Квадратам устанавливать контакты. " +
        "Квадраты неэффективно действуют в аморфной ситуации.",

    triangle = "ТРЕУГОЛЬНИК символизирует лидерство, и многие Треугольники ощущают в этом свое предназначение. " +
        "Самая характерная особенность истинного Треугольника – способность концентрироваться на главной цели. " +
        "Они – энергичны и сильны. " +
        "Треугольники, как и их родственники Квадраты, " +
        "относятся к линейным формам и в тенденции также являются «левополушарными» мыслителями, " +
        "способными глубоко и быстро анализировать ситуации. " +
        "В противоположность Квадратам, ориентированным на детали, Треугольники сосредоточиваются на сути проблемы. " +
        "Их прагматическая ориентация направляет мыслительный анализ и ограничивает его поиском эффективного в данных условиях решения. " +
        "Треугольник – очень уверенный человек. " +
        "Потребность быть правым и управлять положением дел, решать не только за себя, но и за других, " +
        "делает Треугольника личностью, постоянно соперничающей, конкурирующей с другими. " +
        "Треугольники с трудом признают свои ошибки! Они видят то, что хотят видеть, " +
        "не любят менять свои решения, часто бывают категоричны. " +
        "К счастью (для них и окружающих), Треугольники быстро и успешно учатся (впитывают полезную информацию, как губка), " +
        "правда, только тому, что соответствует их прагматической ориентации, способствует достижению главного. " +
        "Треугольники честолюбивы. " +
        "Из них получаются отличные менеджеры. " +
        "Главное отрицательное качество Треугольников: сильный эгоцентризм, направленность на себя. " +
        "На пути к вершинам власти они не проявляют особой щепетильности. " +
        "Треугольники заставляют все и всех вращаться вокруг себя... " +
        "Может быть, без них жизнь потеряла бы свою остроту.",

    rectangle = "ПРЯМОУГОЛЬНИК – фигура, символизирующая состояние перехода и изменения. " +
        "Это временная форма личности, которую могут «носить» остальные четыре сравнительно устойчивые фигуры в определенные периоды. " +
        "Это люди, не удовлетворенные тем образом жизни, который они ведут сейчас, и занятые поисками лучшего положения. " +
        "Основное психическое состояние Прямоугольников – замешательство, запутанность в проблемах. " +
        "Наиболее характерные черты – непоследовательность и непредсказуемость поступков в течение переходного периода. " +
        "Они часто имеют низкую самооценку. " +
        "Стремятся стать лучше в чем-то, ищут новые методы работы, стили жизни. " +
        "Непредсказуемые изменения в поведении Прямоугольника обычно смущают и настораживают других людей, " +
        "и они сознательно могут уклоняться от контактов с «человеком без стержня». " +
        "Прямоугольникам же общение с другими людьми необходимо. " +
        "Это еще одна сложность переходного периода. " +
        "У Прямоугольника есть и позитивные, привлекательные качества: любознательность, пытливость, интерес к происходящему и... " +
        "смелость! Они открыты для новых идей, ценностей, способов мышления и жизни, легко усваивают все новое. " +
        "Оборотной стороной этого является чрезмерная доверчивость, внушаемость. " +
        "Прямоугольниками легко манипулировать. " +
        "«Прямоугольность» – всего лишь стадия. " +
        "Она пройдет!",

    circle = "КРУГ – это мифологический символ гармонии. " +
        "Тот, кто уверенно выбирает его, искренне заинтересован в хороших межличностных отношениях. " +
        "Высшая ценность для Круга – люди. " +
        "Круг – самая доброжелательная из пяти форм. " +
        "Он стабилизирует группу. " +
        "Круги – лучшие слушатели. " +
        "Они обладают высокой чувствительностью, способностью сопереживать. " +
        "Круги великолепно «читают» людей и в одну минуту способны распознать притворщика, обманщика. " +
        "Круги «болеют» за свой коллектив и популярны среди коллег по работе. " +
        "Однако они, как правило, слабые менеджеры и руководители. " +
        "Во-первых, Круги направлены скорее на людей, чем на дело. " +
        "Пытаясь сохранить мир, они избегают занимать «твердую» позицию и принимать непопулярные решения. " +
        "Для Круга нет ничего более тяжкого, чем вступать в межличностный конфликт. " +
        "Во-вторых, Круги вообще не отличаются решительностью, часто не могут подать себя должным образом. " +
        "Однако их не слишком беспокоит, в чьих руках находится власть. " +
        "В одном Круги проявляют завидную твердость – если дело касается вопросов морали или нарушения справедливости. " +
        "Круг – нелинейная форма, и те, кто уверенно идентифицирует себя с кругом, скорее относятся к «правополушарным» мыслителям. " +
        "«Правополушарное» мышление – более образное, интуитивное, эмоционально окрашенное, чем анализирующее. " +
        "Поэтому переработка информации у Кругов осуществляется не последовательно, а скорее мозаично, прорывами. " +
        "Это не означает, что Круги не в ладах с логикой. " +
        "Просто главная черта их мышления – ориентация на субъективные факторы проблемы (ценности, оценки, чувства) " +
        "и стремление найти общее даже в противоположных точках зрения. " +
        "Круг – прирожденный психолог, но слабый организатор.",

    zigzag = "ЗИГЗАГ – самая уникальная из пяти фигур и единственная разомкнутая. " +
        "Эта фигура символизирует креативность, творчество. " +
        "Если вы твердо выбрали зигзаг в качестве основной формы, то вы, скорее всего, " +
        "истинный «правополушарный» мыслитель, инакомыслящий. " +
        "Вам свойственны образность, интуитивность, мозаичность. " +
        "Строгая, последовательная дедукция – это не ваш стиль. " +
        "Мысль Зигзага делает отчаянные прыжки от «а» к «я», поэтому многим «левополушарным» трудно понять Зигзагов. " +
        "«Правополушарное» мышление не фиксируется на деталях, поэтому оно, упрощая в чем-то картину мира, " +
        "позволяет строить целостные, гармоничные концепции и образы, видеть красоту. " +
        "Зигзаги обычно имеют развитое эстетическое чувство. " +
        "Доминирующим стилем мышления Зигзага чаще всего является синтетический стиль. " +
        "Зигзаги не заинтересованы в консенсусе и добиваются синтеза заострением конфликта идей и построением новой концепции, " +
        "в которой этот конфликт получает свое разрешение, «снимается». " +
        "Причем, используя природное остроумие, они могут быть весьма язвительными, «открывая глаза» другим. " +
        "Зигзаги просто не могут трудиться в хорошо структурированных ситуациях. " +
        "Их раздражают четкие вертикальные и горизонтальные связи, строго фиксированные обязанности и постоянные способы работы. " +
        "В работе им требуется независимость от других и высокий уровень стимуляции на рабочем месте. " +
        "Тогда Зигзаг «оживает» и начинает выполнять свое основное назначение – генерировать новые идеи и методы работы. " +
        "Зигзаги – идеалисты, отсюда берут начало такие их черты как непрактичность, наивность. " +
        "Зигзаг – самый возбудимый из пяти фигур. " +
        "Они несдержанны, очень экспрессивны, что, наряду с их эксцентричностью, часто мешает им проводить свои идеи в жизнь. " +
        "К тому же они не сильны в проработке конкретных деталей и не слишком настойчивы в доведении дела до конца (так как с утратой новизны теряется и интерес к идее).";

module.exports = {
    name: "Психогеометрический",
    type: require('../types').PSYCHOGEOMETRICAL,
    icon: 'yeoman.png',
    shortDesc: "Психогеометрия как система сложилась в США. Автор этой системы Сьюзен Деллингер – специалист по социально-психологической подготовке управленческих кадров. Точность диагностики с помощью психогеометрического метода достигает 85%.",
    longDesc: "",
    instruction: instruction,
    content: {
        figures: [
			'rectangle.png',
			'triangle.png',
			'circle.png',
			'square.png',
			'zigzag.png'
		],
        description: {
            rectangle: rectangle,
            triangle: triangle,
            circle: circle,
            square: square,
            zigzag: zigzag
        }
    }
};
